---
kind: method
id: M:Autodesk.Revit.DB.FaceSecondDerivatives.Dispose
source: html/40a3778d-1f7e-4a5c-8373-420bb009a11b.htm
---
# Autodesk.Revit.DB.FaceSecondDerivatives.Dispose Method

Releases all resources used by the FaceSecondDerivatives

## Syntax (C#)
```csharp
public void Dispose()
```